Revit 2024 API
Polyloop.Centroid Property
 The polygon centroid.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public XYZ Centroid { get; }
Visual Basic
Public ReadOnly Property Centroid As XYZ
	Get
Visual C++
public:
property XYZ^ Centroid {
	XYZ^ get ();
}
See Also
Polyloop Class
Autodesk.Revit.DB.Analysis Namespace